from scanner import BetterScanner
from test import test_urls


def main():
    scanner = BetterScanner()
    # ========================= CLI MENU =========================
# ========================= CLI MENU =========================
    BANNER = r"""
██████╗ ██╗  ██╗██╗███████╗ ██████╗ ██    ██╗ █████╗ ██████╗ ██████╔
██╔══██╗██║  ██║██║██╔════╝██╔═══██╗██╔═══██╗██╔══██╗██╔══██╗██║   ██║
██████╔╝███████║██║███████╗██║      ██║   ██║███████║██████╔╝██║   ██║
██╔═══╝ ██╔══██║██║╚════██║██║ ████║██║   ██║██╔══██║██╔═██══██║   ██║
██║     ██║  ██║██║███████║╚██████╔╝╚██████╔╝██║  ██║██║  ██ ██████╔╝
╚═╝     ╚═╝  ╚═╝╚═╝╚══════╝ ╚═════╝  ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝
"""
    print(BANNER)

    print("🛡️  SIMPLE URL SAFETY CHECKER")
    print("=" * 40)

    while True:
        print("\nChoose an option:") 
        print("1. Check a URL")
        print("2. Test examples")
        print("3. See statistics") 
        print("4. Quit")
        choice = input("\nEnter 1, 2, 3, or 4: ")
        if choice == '1': 
            url = input("Enter website address: ")
            scanner.check_url(url)
        elif choice == '2':
            for url in test_urls:
                print("\n" + "-" * 40)
                scanner.check_url(url)
                print("-" * 40)
        elif choice == '3':
            scanner.show_stats()
        elif choice == '4':
            print("Goodbye! You have exit the PhisGuard project.")
            break
        else:
            print("Invalid choice. Please enter 1, 2, 3, or 4.")

if __name__ == "__main__": 
    main()                 
